In [1]:
# class of 24-Nov-2019

# Handling Missing Data
## NAN (Numpy) in a series

In [2]:
import pandas as pd
import numpy as np  # we have to import it in order to recoginize nan
#from numpy import nan as NA

s1 = pd.Series([1,np.nan,3,4,5,np.nan])
s1

0    1.0
1    NaN
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

## press shift+tab to get more info about a method

In [3]:
s1.isnull()

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [4]:
s1[s1.isnull()] # it will only return the true value

1   NaN
5   NaN
dtype: float64

In [5]:
s1.notnull()

0     True
1    False
2     True
3     True
4     True
5    False
dtype: bool

In [6]:
s1[s1.notnull()] # series mein wo detect karey jo null nhi hain
s1.dropna(inplace=True) #pandas method, but it will not update in memory. To do that pass argument 'inplace'
s1

0    1.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [7]:
s1
# task to remove NAN

0    1.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [8]:
s1[5] = 6 # noobish approch
s1 = s1[s1.notnull()] # all values that did'nt had null values were assinged to this
s1

0    1.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [9]:
#s1.index = [0,1,2,3,4] # to make index normal
#other method
s1.reset_index() #it will turn it into a dataframe
s1

0    1.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

## Drop NA in a frame

In [10]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna() # it is bad because it removed almost all of the data

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how="all")# this how = all will drop if all will be NAN, any removes all the rows that contain NAN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna(thresh=2) # at least 2 NAN values will be removed, axis change will cause to iterate row wise not column wise

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

## Filter

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA # fill everything with NA
df.iloc[:2, 2] = NA
df # by default column k names 0, 1, 2

          0         1         2
0 -0.382937       NaN       NaN
1  0.888835       NaN       NaN
2  0.237876       NaN  0.025356
3 -0.124593       NaN -0.579882
4  0.459259  0.456573 -0.234530
5  0.413638  0.107921  0.797685
6  1.505431 -0.824759 -2.296777

## Filling In Missing Data

In [15]:
df.fillna(13) # all null values will become the number we pass in
df # not changing in the memory so we have to use inplace

          0         1         2
0 -0.382937       NaN       NaN
1  0.888835       NaN       NaN
2  0.237876       NaN  0.025356
3 -0.124593       NaN -0.579882
4  0.459259  0.456573 -0.234530
5  0.413638  0.107921  0.797685
6  1.505431 -0.824759 -2.296777

In [16]:
#we want to fill every column with different hardcoded values
df.fillna({1: 1, 2: df[2].mean()}) # we tell column name in the dictionary, fill column 1 with value 1.

          0         1         2
0 -0.382937  1.000000 -0.457630
1  0.888835  1.000000 -0.457630
2  0.237876  1.000000  0.025356
3 -0.124593  1.000000 -0.579882
4  0.459259  0.456573 -0.234530
5  0.413638  0.107921  0.797685
6  1.505431 -0.824759 -2.296777

In [17]:
# Practically every column will have different value of mean and we can fill every column with their own mean using:
# if we have to do row wise then change axis
df.fillna(df.mean())

          0         1         2
0 -0.382937 -0.086755 -0.457630
1  0.888835 -0.086755 -0.457630
2  0.237876 -0.086755  0.025356
3 -0.124593 -0.086755 -0.579882
4  0.459259  0.456573 -0.234530
5  0.413638  0.107921  0.797685
6  1.505431 -0.824759 -2.296777

In [18]:
# it will fill above the value of nan with the last value the column will contian
df.fillna(method='bfill') # will start reading from below and fill it with last read value

          0         1         2
0 -0.382937  0.456573  0.025356
1  0.888835  0.456573  0.025356
2  0.237876  0.456573  0.025356
3 -0.124593  0.456573 -0.579882
4  0.459259  0.456573 -0.234530
5  0.413638  0.107921  0.797685
6  1.505431 -0.824759 -2.296777

In [19]:
df.fillna(method='ffill') # reads data from above, as soon as it finds NA. It will fill everything with the last no. it read
df.fillna(method='ffill', limit=2) #only fill if just 1 NaN occurs
# opposite of the above method

          0         1         2
0 -0.382937       NaN       NaN
1  0.888835       NaN       NaN
2  0.237876       NaN  0.025356
3 -0.124593       NaN -0.579882
4  0.459259  0.456573 -0.234530
5  0.413638  0.107921  0.797685
6  1.505431 -0.824759 -2.296777

# Transformin data
## Removing duplictes

In [20]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 ....: 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [21]:
data.duplicated() #it will check all columns

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [22]:
data.drop_duplicates() # we can use inplace here too

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [23]:
data.drop_duplicates(['k1']) #will only check the column k1

    k1  k2
0  one   1
1  two   1

## Transforming Data Using a Function or Mapping

In [24]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}) # we have to add an animal from whihc meat is obtained
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [25]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
meat_to_animal['bacon']

'pig'

In [26]:
lowercased = data['food'].str.lower() # meat to animal has all keys in lower case
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [27]:
a = lambda x: x.upper() # annonymous function
lowercased.map(a)

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [28]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Replacing values

In [29]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace([-999.0, -1000], [np.nan, 0]) # values will only update if we use inplace

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [36]:
data.replace({-999.0: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [37]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
     ....: index=['Ohio', 'Colorado', 'New York'],
     ....: columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [40]:
transform = lambda x: x[:4].upper() # only returns starting 4 characters
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
data.rename(index=str.title, columns=str.upper, inplace = True)
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11